In [1]:
%pylab inline
import pandas as pd
from pandas import Series, DataFrame

Populating the interactive namespace from numpy and matplotlib

In [2]:
# anything starting with % in Jupyter is a "magic command"
# you can get a full list with %magic

%ls *.csv

burrito_current.csv	   languages.csv  mydata.csv  titanic3.csv
celebrity_deaths_2016.csv  mydat.csv	  taxi.csv

In [3]:
df = pd.read_csv('titanic3.csv')

In [4]:
# files.lerner.co.il

In [5]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [6]:
df = DataFrame(np.random.randint(0, 100, [5,5]),
              index=list('abcde'),
              columns=list('vwxyz'))
df

    v   w   x   y   z
a  34  69  21  99  54
b  91  74  29  28  44
c  23  40  81  63  75
d  88  98  55  19   0
e  88  20  89  19  97

In [7]:
df.columns

Index(['v', 'w', 'x', 'y', 'z'], dtype='object')

In [8]:
df.columns = 'userid w x y z'.split()
df

   userid   w   x   y   z
a      34  69  21  99  54
b      91  74  29  28  44
c      23  40  81  63  75
d      88  98  55  19   0
e      88  20  89  19  97

In [10]:
df[df['userid'] == 91]

   userid   w   x   y   z
b      91  74  29  28  44

In [11]:
df.set_index('userid')

         w   x   y   z
userid
34      69  21  99  54
91      74  29  28  44
23      40  81  63  75
88      98  55  19   0
88      20  89  19  97